[{"id":37,"codersnack":{"id":38,"header":"Introduction and motivation to use Redux","created_at":"2020-02-02T19:57:54.704Z","updated_at":"2020-02-02T19:57:54.704Z","explanation":"Redux is a **predictable state container for JavaScript apps**.\n\nIt helps you write applications that behave consistently, **run in different environments (client, server, and native)**, and are easy to test. \n\nYou **can use Redux together with React, or with any other view library**. It is *tiny* (2kB, including dependencies), but has a large ecosystem of addons available.\n\n#### Basic Example\n**The whole state of your app is stored in an object tree inside a single store**. **The only way to change the state tree is to emit an action,** an object describing what happened. To specify how the **actions** transform the state tree, you write **pure reducers**.\n\nThat's it!\n\n```\nimport { createStore } from 'redux'\n/**\n * This is a reducer, a pure function with (state, action) => state signature.\n * It describes how an action transforms the state into the next state.\n *\n * The shape of the state is up to you: it can be a primitive, an array, an object,\n * or even an Immutable.js data structure. The only important part is that you should\n * not mutate the state object, but return a new object if the state changes.\n *\n * In this example, we use a `switch` statement and strings, but you can use a helper that\n * follows a different convention (such as function maps) if it makes sense for your\n * project.\n */\nfunction counter(state = 0, action) {\n  switch (action.type) {\n    case 'INCREMENT':\n      return state + 1\n    case 'DECREMENT':\n      return state - 1\n    default:\n      return state\n  }\n}\n// Create a Redux store holding the state of your app.\n// Its API is { subscribe, dispatch, getState }.\nlet store = createStore(counter)\n// You can use subscribe() to update the UI in response to state changes.\n// Normally you'd use a view binding library (e.g. React Redux) rather than subscribe() directly.\n// However it can also be handy to persist the current state in the localStorage.\nstore.subscribe(() => console.log(store.getState()))\n// The only way to mutate the internal state is to dispatch an action.\n// The actions can be serialized, logged or stored and later replayed.\nstore.dispatch({ type: 'INCREMENT' })\n// 1\nstore.dispatch({ type: 'INCREMENT' })\n// 2\nstore.dispatch({ type: 'DECREMENT' })\n// 1\n```\n\n>The only important part is that you should not mutate the state object, but return a new object if the state changes.\n\n#### Motivation\nAs the requirements for JavaScript single-page applications have become increasingly complicated, **our code must manage more state than ever before.** This state can include server responses and cached data, as well as locally created data that has not yet been persisted to the server. **UI state is also increasing in complexity**, as we need to manage active routes, selected tabs, spinners, pagination controls, and so on.\n\n**Managing this ever-changing state is hard**. If a model can update another model, then a view can update a model, which updates another model, and this, in turn, might cause another view to update. At some point, you no longer understand what happens in your app as you have lost control over the when, why, and how of its state. **When a system is opaque and non-deterministic, it's hard to reproduce bugs or add new features**.\n\nAs if this weren't bad enough, consider the new requirements becoming common in front-end product development. As developers, we are expected to handle optimistic updates, server-side rendering, fetching data before performing route transitions, and so on. We find ourselves trying to manage a complexity that we have never had to deal with before, and we inevitably ask the question: is it time to give up? The answer is no.\n\n**This complexity is difficult to handle as we're mixing two concepts** that are very hard for the human mind to reason about: **mutation** and **asynchronicity**. I call them Mentos and Coke. Both can be great in separation, but together they create a mess. Libraries like React attempt to solve this problem in the view layer by removing both asynchrony and direct DOM manipulation. However, managing the state of your data is left up to you. This is where Redux enters.\n\nFollowing in the steps of Flux, CQRS, and Event Sourcing, **Redux attempts to make state mutations predictable by imposing certain restrictions on how and when updates can happen**. These restrictions are reflected in the three principles of Redux.\n","references":"- [Reduxjs.org - getting started](https://redux.js.org/introduction/getting-started)","featured_image_url":"https://codersnack.com/assets/images/redux-icon.png","slug":"redux-introduction","weblink":"https://codersnack.com/redux-introduction/","featured_image_preview":{"id":49,"name":"redux-icon.png","hash":"fa9accd5c77b4d3fa0298f36b39f1170","sha256":"dX3lYJfNhHH-pzcAbNLPqjVHxPL2d_XwAvW7UAO7cbQ","ext":".png","mime":"image/png","size":13.16,"url":"/uploads/fa9accd5c77b4d3fa0298f36b39f1170.png","provider":"local","provider_metadata":null,"created_at":"2020-02-02T19:57:54.714Z","updated_at":"2020-02-02T19:57:54.714Z"}},"codersnacks_category":{"id":9,"header":"Redux","description":"Redux is a predictable state container for JavaScript apps\n","snacks_by_cat_json_filename":"redux.snacks.json","key":"redux","image_url":"https://codersnack.com/assets/images/redux-icon.png","created_at":"2020-02-02T19:44:33.815Z","updated_at":"2020-02-02T19:44:33.815Z","image_preview":{"id":48,"name":"redux-icon.png","hash":"5e195631c5f84239a5a369136ac0107c","sha256":"dX3lYJfNhHH-pzcAbNLPqjVHxPL2d_XwAvW7UAO7cbQ","ext":".png","mime":"image/png","size":13.16,"url":"/uploads/5e195631c5f84239a5a369136ac0107c.png","provider":"local","provider_metadata":null,"created_at":"2020-02-02T19:44:33.844Z","updated_at":"2020-02-02T19:44:33.844Z"}},"title":"Redux introduction and motivation","created_at":"2020-02-02T19:58:17.537Z","updated_at":"2020-02-02T19:58:17.539Z"}]