[{"id":44,"codersnack":{"id":47,"header":"Typescript introduction","created_at":"2020-02-11T21:45:15.749Z","updated_at":"2020-02-11T21:45:15.749Z","explanation":"TypeScript is an open-source programming language developed and maintained by **Microsoft**. It is **a strict syntactical superset of JavaScript, and adds optional static typing to the language**.\n\nTypeScript is a strict superset of ECMAScript 2015, which is itself a superset of ECMAScript 5, commonly referred to as JavaScript. As such, **a JavaScript program is also a valid TypeScript program**, and a TypeScript program can seamlessly consume JavaScript. By default the compiler targets ECMAScript 5, the current prevailing standard, but is also able to generate constructs used in ECMAScript 3 or 2015.\n\nWith TypeScript, it is possible to use existing JavaScript code, incorporate popular JavaScript libraries, and call TypeScript-generated code from other JavaScript. Type declarations for these libraries are provided with the source code.\n\n#### Type annotations\n**TypeScript provides static typing through type annotations to enable type checking at compile time**. This is optional and **can be ignored** to use the regular dynamic typing of JavaScript.\n```\nfunction add(left: number, right: number): number {\n\treturn left + right;\n}\n```\nThe annotations for the primitive types are *number*, *boolean* and *string*. Weakly or dynamically-typed structures are of type *any*.\n\n**Type annotations can be exported to a separate declarations file** to make type information available for TypeScript scripts using types already compiled into JavaScript. Annotations can be declared for an existing JavaScript library, as has been done for Node.js and jQuery.\n\n**The TypeScript compiler makes use of type inference** to infer types when types are not given. For example, the add method in the code above would be inferred as returning a number even if no return type annotation had been provided. This is based on the static types of left and right being numbers, and the compiler's knowledge that the result of adding two numbers is always a number. However, explicitly declaring the return type allows the compiler to verify correctness.\n\nIf no type can be inferred because of lack of declarations, then it defaults to the dynamic any type. **A value of the *any* type supports the same operations as a value in JavaScript** and minimal static type checking is performed for operations on any values.\n\n#### Declaration files\nWhen a TypeScript script gets compiled there is an option to generate a declaration file (with the **extension .d.ts**) that functions as **an interface to the components in the compiled JavaScrip**t. In the process the compiler strips away all function and method bodies and preserves only the signatures of the types that are exported. The resulting declaration file **can then be used to describe the exported virtual TypeScript types of a JavaScript library or module when a third-party developer consumes it from TypeScript.**\n\nThe concept of declaration files is analogous to the concept of header file found in C/C++.\n\n```\ndeclare namespace arithmetics {\n    add(left: number, right: number): number;\n    subtract(left: number, right: number): number;\n    multiply(left: number, right: number): number;\n    divide(left: number, right: number): number;\n}\n```\nType declaration files can be written by hand for existing JavaScript libraries, as has been done for jQuery and Node.js.\n\nLarge collections of declaration files for popular JavaScript libraries are hosted on GitHub in DefinitelyTyped","references":"- [Wikipedia -Typescript](https://en.wikipedia.org/wiki/TypeScript)","featured_image_url":"https://codersnack.com/assets/images/typescript-icon.png","slug":"typescript-introduction","weblink":"https://codersnack.com/typescript-introduction/","featured_image_preview":{"id":59,"name":"typescript-icon.png","hash":"51965127b8234ae0805f416599e2fa28","sha256":"ZgtqQkJg-bfOvA-p5xP8Mh5khfeqvzuCd6612g-G6rk","ext":".png","mime":"image/png","size":11.79,"url":"/uploads/51965127b8234ae0805f416599e2fa28.png","provider":"local","provider_metadata":null,"created_at":"2020-02-11T21:45:15.758Z","updated_at":"2020-02-11T21:45:15.758Z"}},"codersnacks_quiz":{"id":44,"question":"What is the difference between Javascript and Typescript?","response_valid":"Typescript is a strict syntactical superset of JavaScript, and adds optional static typing to the language","response_invalid1":"Typescript is a JS library to add custom font families","response_invalid2":"ECMAScript 7 is called as the alias \"Typescript\"","created_at":"2020-02-11T21:48:25.902Z","updated_at":"2020-02-11T21:48:25.902Z"},"codersnacks_category":{"id":10,"header":"Typescript","description":"Syntactical superset of JavaScript to adds optional static typing to Javascript","snacks_by_cat_json_filename":"typescript.snacks.json","key":"typescript","image_url":"https://codersnack.com/assets/images/typescript-icon.png","created_at":"2020-02-11T21:36:00.170Z","updated_at":"2020-02-11T21:36:00.170Z","image_preview":{"id":58,"name":"typescript-icon.png","hash":"3ccf0f127c3f4151a021a2d16c915042","sha256":"ZgtqQkJg-bfOvA-p5xP8Mh5khfeqvzuCd6612g-G6rk","ext":".png","mime":"image/png","size":11.79,"url":"/uploads/3ccf0f127c3f4151a021a2d16c915042.png","provider":"local","provider_metadata":null,"created_at":"2020-02-11T21:36:00.187Z","updated_at":"2020-02-11T21:36:00.187Z"}},"title":"Typescript difference with javascript","created_at":"2020-02-11T21:48:56.492Z","updated_at":"2020-02-11T21:48:56.497Z"}]