[{"id":96,"codersnack":{"id":97,"header":"What is Material Design?","created_at":"2021-10-29T10:52:19.497Z","updated_at":"2021-10-29T11:31:14.049Z","explanation":"Material Design is an **Android-oriented design language created by Google**, supporting onscreen touch experiences via cue-rich features and natural motions that **mimic real-world objects**. Designers optimize users’ experience with 3D effects, realistic lighting and animation features in immersive, platform-consistent GUIs.\n\n### Material Design – Why Users trust \"Realer\" Interfaces\n\nMaterial Design emerged as Google’s brainchild in **mid-2014**, codenamed \"Quantum Paper\" and representing a fresh \"ink-and-pen\" approach. With Material Design, the goal is to **deliver high-quality output consistently across platforms**, giving users control over clearly indicated, pleasant-looking components that behave like real-world objects. \n\nUnlike the portrayal of culture-relevant items (e.g., wastebaskets) in skeuomorphism, with **Material Design designers apply basic, natural laws from the physical world, principally concerning lighting and motion.** The idea is that by mimicking the physical world, we reduce users' cognitive loads through careful attention to layout, visual language and pattern library, maximizing predictability and eliminating ambiguity. Material Design's \"card\" concept serves as a **system for layering elements and animations**; it also permits a more personalized experience (e.g., showing followers on Twitter).\n\n\"Unlike real paper, our digital material can expand and reform intelligently. Material has physical surfaces and edges. Seams and shadows provide meaning about what you can touch.\"\n\n— Matias Duarte, VP of Material Design at Google\n\nIt’s vital for Material Design to meet users' expectations of how components should behave. For instance, onscreen objects are more credible if they follow the laws of gravity.\n\n### \"Magical\" and \"Predictable\" – an Indispensable Paradox\n\nTo apply Material Design effectively, you need to understand these principles:\n\n**1. The metaphor of material**\nYou take the concept of tactile reality, and you:\n\n- *Design to offer users attributes they find familiar as affordances*. Immediately recognizable real-world features such as buttons should instantly let users see what to do. Surfaces and seams/edges must complement these by offering hints. Use realistic light/shadowing to divide the design space and reveal moving parts.\n- *Use an adaptive design* – ensure hierarchy, colors, icons and spatial proportions are consistent across all devices through adaptive version selection.\n\n**2. Bold, graphic and well-chosen elements add meaning and are pleasing to the eye**\n- *Make designs bold so users notice hierarchy instantly and can focus and draw appropriate meanings*. Excellent color and whitespace use, strong imagery and large typography across the screen help users become immersed in the experience.\n- *Design to prompt users to act*, and show functionality by emphasizing icons and surfaces as cues.\n\n**3. Make messages with motion**\n- Put users in control by *showing changes resulting directly from their actions*.\n- Make animations play out in a single environment/stage, in continuous flowing movements.\n- *Ensure responses are clear, but subtle*: no jerky/unpredictable movements.\n\nIt's critical to combine bold, deliberate design choices with subtlety regarding their natural reactions to user input. For example, if the user drops a selected item into a group of objects, the latter should move aside, accommodating it. **In Material Design we try not to let objects do magical things,** such as vanish or move on their own. Instead, we **translate the familiarity of the limited, physical world onto screens** that have unlimited potential. YouTube’s infinite scrolling exemplifies this.\n\n![Using contrasting surface fills to depict elevation](https://codersnack.com/assets/images/ux-contrast-elevation.png)\n*Using contrasting surface fills to depict elevation*\n\n### Material Design, Redesigned\n\n**In May 2018, Google released a revised version to remedy a major problem** – the original guidelines were restrictive, emphasizing function over style. Because apps created in line with these looked alike, **many app makers disliked Material Design**. Google had to balance Material Design’s consistency with the capacity for differentiation – to grant designers the flexibility to adapt it to brand needs. \n\nVersion 2 features not only **new guidelines** but also a tool suite (including **new icon packs** and a **Material Theme editor)** you can use to **customize your designs**. Therefore, you can fine-tune aesthetics to suit your organization’s brand presence while you build on the foundation of timeless natural laws.\n\n### Learn More about Material Design\n\nYou’ll find Google’s Material Design guidelines and library here: https://design.google/resources/ and here: [Material IO Design](https://material.io/design/)\n\nLearn how to create interfaces that mimic real-world objects: \n[how-to-create-intuitive-products-by-imitating-physicality](https://www.interaction-design.org/courses/how-to-create-intuitive-products-by-imitating-physicality)\n\nA detailed piece on standing out with Material Design: \n[10-guidelines-material-design](https://usabilitygeek.com/10-guidelines-material-design/)\n\nAn enlightening do’s-and-don’ts guide to Material Design: \n[dont-risk-making-a-crappy-ui-use-material-design](https://uxplanet.org/dont-risk-making-a-crappy-ui-use-material-design-520ebaceffe4)","references":"- [Interaction Design Foundation](https://www.interaction-design.org/literature/topics/material-design)","featured_image_url":"https://codersnack.com/assets/images/ux-logo.png","slug":"what-is-material","weblink":"https://codersnack.com/what-is-material","featured_image_preview":{"id":132,"name":"ux-logo.png","hash":"d1a0fc7e44804207b250617bcf03d5b3","sha256":"sK0UTvFTJMNL-mO6JsooVe-EDxLjPcPFB7bre-RlHUU","ext":".png","mime":"image/png","size":158.23,"url":"/uploads/d1a0fc7e44804207b250617bcf03d5b3.png","provider":"local","provider_metadata":null,"created_at":"2021-10-29T11:21:33.887Z","updated_at":"2021-10-29T11:21:33.887Z"}},"codersnacks_category":{"id":18,"header":"UX Design","description":"User Experience, Design Tips, Usability, etc","snacks_by_cat_json_filename":"ux.snacks.json","key":"ux","image_url":"https://codersnack.com/assets/images/ux-logo.png","created_at":"2021-10-29T10:12:53.307Z","updated_at":"2021-10-29T11:21:18.987Z","image_preview":{"id":131,"name":"ux-logo.png","hash":"e8ce45f7475b4cf59fb77ef694e0e2a6","sha256":"sK0UTvFTJMNL-mO6JsooVe-EDxLjPcPFB7bre-RlHUU","ext":".png","mime":"image/png","size":158.23,"url":"/uploads/e8ce45f7475b4cf59fb77ef694e0e2a6.png","provider":"local","provider_metadata":null,"created_at":"2021-10-29T11:21:19.027Z","updated_at":"2021-10-29T11:21:19.027Z"}},"title":"UX-What is Material Design","created_at":"2021-10-29T10:53:21.576Z","updated_at":"2021-10-29T10:53:21.586Z"}]