[{"id":169,"codersnack":{"id":165,"header":"Web Standards - Cookies History & How It works","created_at":"2022-04-06T12:16:58.849Z","updated_at":"2022-04-06T12:18:12.692Z","explanation":"\n##  A brief history of cookies\n\n**HTTP**, or the Hypertext Transfer Protocol, is a **stateless protocol.** According to Wikipedia, its a stateless protocol because it \"does not require the HTTP server to retain information or status about each user for the duration of multiple requests.\" You can still see this today with simple websites – you type in the URL to the browser, the browser makes a request to a server somewhere, and the **server returns the files to render the page and the connection is closed**.\n\nNow **imagine that you need to sign in to a website to see certain content, like with LinkedIn**. The process is largely the same as the one above, but you're presented with a form to enter in your email address and password.\n\nYou enter that information in and your browser sends it to the server. The server checks your login information, and if everything looks good, it sends the data needed to render the page back to your browser.\n\n**But if LinkedIn was truly stateless, once you navigate to a different page, the server would not remember that you just signed in**. It would ask you to **enter in your email address and password again**, check them, then send over the data to render the new page.\n\nThat would be super frustrating, wouldn't it? A lot of developers thought so, too, and found different ways to create stateful sessions on the web.\n\n\n##   The invention of the HTTP cookie\n\n**Lou Montoulli**, a developer at Netscape in the early 90s, had a problem – he was **developing an online store** for another company, MCI, which would store the items in each customer's cart on its servers. This meant that people had to create an account first, it was slow, and it took up a lot of storage.\n\nMCI requested for all of this **data to be stored on each customer's own computer instead**. Also, they wanted everything to **work without customers having to sign in first**.\n\nTo solve this, Lou turned to an idea that was already pretty well known among programmers: the **magic cookie**.\n\nA magic cookie, or just cookie, is a **bit of data that's passed between two computer programs**. They're \"magic\" because the data in the cookie is often a **random key or token**, and is really just meant for the software using it.\n\nLou took the magic cookie concept and applied it to the online store, and later to browsers as a whole.\n\nNow that you know about their history, let's take a quick look at how cookies are used to create **stateful sessions on the web**.\n\n\n##  How cookies work\n\nOne way to think of cookies is that they're a bit **like the wristbands you get when you visit an amusement park.**\n\nFor example, when you sign in to a website, it's like the process of entering an amusement park. First you pay for a ticket, then when you enter the park, the staff checks your ticket and gives you a wristband.\n\nThis is like **how you sign in**:\n- the server **checks** your username and password.\n- **creates** and **stores** a session\n- generates a **unique session id**\n- and **sends back a cookie** with the session id.\n\n> **Note** that the session id is not your password, but is something completely separate and generated on the fly. Proper password handling and authentication is outside the scope of this article, but you can find some in depth guides here.\n\nWhile you're in the amusement park, you can go on any ride by showing your wristband.\n\nSimilarly, **when you make requests to the website you're signed in to, your browser sends your cookie with your session id back to the server**. The server checks for your session using your session id, then returns data for your request.\n\nFinally, once you leave the amusement park, your wristband no longer works – you can't use it to get back into the park or go on more rides.\n\nThis is like **signing out of a website**:\n- Your **browser sends your sign out request to the server** with your cookie, \n- the **server removes your session**\n- and **lets your browser know to remove your session id cookie**.\n\nIf you want to get back into the amusement park, you'd have to buy another ticket and get another wristband. In other words, if you want to continue using the website, you'd have to sign back in.\n\n\n![fireship cookies](https://codersnack.com/assets/images/fireship-cookies.png)\n","references":"- [Everything You Need to Know About Cookies for Web Development - Kris Koishigawa](https://www.freecodecamp.org/news/everything-you-need-to-know-about-cookies-for-web-development/)","featured_image_url":"https://codersnack.com/assets/images/web-standards-logo.png","slug":"web-standards-cookies-history-how-it-works","weblink":"https://codersnack.com/web-standards-cookies-history-how-it-works","featured_image_preview":{"id":206,"name":"web-standards-logo.png","hash":"295cfbb639d547b7a5d81b8879fec5ce","sha256":"h6yD0wBq4kdFylxQGYdTnkT9jouDkB8jx23AYEhxW30","ext":".png","mime":"image/png","size":7.04,"url":"/uploads/295cfbb639d547b7a5d81b8879fec5ce.png","provider":"local","provider_metadata":null,"created_at":"2022-04-06T12:16:58.859Z","updated_at":"2022-04-06T12:16:58.859Z"}},"codersnacks_category":{"id":25,"header":"Web Standards","description":"All about web standards","snacks_by_cat_json_filename":"web-standards.snacks.json","key":"web-standards","image_url":"https://codersnack.com/assets/images/web-standards-logo","created_at":"2022-04-06T11:46:29.528Z","updated_at":"2022-04-06T11:46:29.528Z","image_preview":{"id":205,"name":"web-standards-logo.png","hash":"49a914d205d24f1487f0cf52c3b703b0","sha256":"h6yD0wBq4kdFylxQGYdTnkT9jouDkB8jx23AYEhxW30","ext":".png","mime":"image/png","size":7.04,"url":"/uploads/49a914d205d24f1487f0cf52c3b703b0.png","provider":"local","provider_metadata":null,"created_at":"2022-04-06T11:46:29.544Z","updated_at":"2022-04-06T11:46:29.544Z"}},"title":"Web standards - Cookies history and how it works","created_at":"2022-04-06T12:17:43.365Z","updated_at":"2022-04-06T12:17:43.368Z"}]