[{"id":169,"codersnack":{"id":165,"header":"Web Standards - Cookies History & How It works","created_at":"2022-04-06T12:16:58.849Z","updated_at":"2022-04-06T12:18:12.692Z","explanation":"\n##  A brief history of cookies\n\n**HTTP**, or the Hypertext Transfer Protocol, is a **stateless protocol.** According to Wikipedia, its a stateless protocol because it \"does not require the HTTP server to retain information or status about each user for the duration of multiple requests.\" You can still see this today with simple websites – you type in the URL to the browser, the browser makes a request to a server somewhere, and the **server returns the files to render the page and the connection is closed**.\n\nNow **imagine that you need to sign in to a website to see certain content, like with LinkedIn**. The process is largely the same as the one above, but you're presented with a form to enter in your email address and password.\n\nYou enter that information in and your browser sends it to the server. The server checks your login information, and if everything looks good, it sends the data needed to render the page back to your browser.\n\n**But if LinkedIn was truly stateless, once you navigate to a different page, the server would not remember that you just signed in**. It would ask you to **enter in your email address and password again**, check them, then send over the data to render the new page.\n\nThat would be super frustrating, wouldn't it? A lot of developers thought so, too, and found different ways to create stateful sessions on the web.\n\n\n##   The invention of the HTTP cookie\n\n**Lou Montoulli**, a developer at Netscape in the early 90s, had a problem – he was **developing an online store** for another company, MCI, which would store the items in each customer's cart on its servers. This meant that people had to create an account first, it was slow, and it took up a lot of storage.\n\nMCI requested for all of this **data to be stored on each customer's own computer instead**. Also, they wanted everything to **work without customers having to sign in first**.\n\nTo solve this, Lou turned to an idea that was already pretty well known among programmers: the **magic cookie**.\n\nA magic cookie, or just cookie, is a **bit of data that's passed between two computer programs**. They're \"magic\" because the data in the cookie is often a **random key or token**, and is really just meant for the software using it.\n\nLou took the magic cookie concept and applied it to the online store, and later to browsers as a whole.\n\nNow that you know about their history, let's take a quick look at how cookies are used to create **stateful sessions on the web**.\n\n\n##  How cookies work\n\nOne way to think of cookies is that they're a bit **like the wristbands you get when you visit an amusement park.**\n\nFor example, when you sign in to a website, it's like the process of entering an amusement park. First you pay for a ticket, then when you enter the park, the staff checks your ticket and gives you a wristband.\n\nThis is like **how you sign in**:\n- the server **checks** your username and password.\n- **creates** and **stores** a session\n- generates a **unique session id**\n- and **sends back a cookie** with the session id.\n\n> **Note** that the session id is not your password, but is something completely separate and generated on the fly. Proper password handling and authentication is outside the scope of this article, but you can find some in depth guides here.\n\nWhile you're in the amusement park, you can go on any ride by showing your wristband.\n\nSimilarly, **when you make requests to the website you're signed in to, your browser sends your cookie with your session id back to the server**. The server checks for your session using your session id, then returns data for your request.\n\nFinally, once you leave the amusement park, your wristband no longer works – you can't use it to get back into the park or go on more rides.\n\nThis is like **signing out of a website**:\n- Your **browser sends your sign out request to the server** with your cookie, \n- the **server removes your session**\n- and **lets your browser know to remove your session id cookie**.\n\nIf you want to get back into the amusement park, you'd have to buy another ticket and get another wristband. In other words, if you want to continue using the website, you'd have to sign back in.\n\n\n![fireship cookies](https://codersnack.com/assets/images/fireship-cookies.png)\n","references":"- [Everything You Need to Know About Cookies for Web Development - Kris Koishigawa](https://www.freecodecamp.org/news/everything-you-need-to-know-about-cookies-for-web-development/)","featured_image_url":"https://codersnack.com/assets/images/web-standards-logo.png","slug":"web-standards-cookies-history-how-it-works","weblink":"https://codersnack.com/web-standards-cookies-history-how-it-works","featured_image_preview":{"id":206,"name":"web-standards-logo.png","hash":"295cfbb639d547b7a5d81b8879fec5ce","sha256":"h6yD0wBq4kdFylxQGYdTnkT9jouDkB8jx23AYEhxW30","ext":".png","mime":"image/png","size":7.04,"url":"/uploads/295cfbb639d547b7a5d81b8879fec5ce.png","provider":"local","provider_metadata":null,"created_at":"2022-04-06T12:16:58.859Z","updated_at":"2022-04-06T12:16:58.859Z"}},"codersnacks_category":{"id":25,"header":"Web Standards","description":"All about web standards","snacks_by_cat_json_filename":"web-standards.snacks.json","key":"web-standards","image_url":"https://codersnack.com/assets/images/web-standards-logo.png","created_at":"2022-04-06T11:46:29.528Z","updated_at":"2022-04-06T12:28:37.991Z","image_preview":{"id":205,"name":"web-standards-logo.png","hash":"49a914d205d24f1487f0cf52c3b703b0","sha256":"h6yD0wBq4kdFylxQGYdTnkT9jouDkB8jx23AYEhxW30","ext":".png","mime":"image/png","size":7.04,"url":"/uploads/49a914d205d24f1487f0cf52c3b703b0.png","provider":"local","provider_metadata":null,"created_at":"2022-04-06T11:46:29.544Z","updated_at":"2022-04-06T11:46:29.544Z"}},"title":"Web standards - Cookies history and how it works","created_at":"2022-04-06T12:17:43.365Z","updated_at":"2022-04-06T12:17:43.368Z"},{"id":170,"codersnack":{"id":166,"header":"Web Standards - Cookies - Security Concerns","created_at":"2022-04-06T13:35:27.424Z","updated_at":"2022-04-06T13:44:49.786Z","explanation":"\n##  Security concerns with cookies\n\nIn general, cookies are very secure when implemented correctly. Browsers have a lot of built-in limitations that we covered earlier, partly due to the age of the technology, but also to improve security.\n\nStill, **there are a few ways that a bad actor can steal your cookie and use it to wreak havoc**.\n\nWe'll go over some common ways this can happen, and look at different ways to fix it.\n\nAlso, note that any code snippets will be in vanilla JavaScript. If you want to implement these fixes on the server, you'll need to look up the exact syntax for your language or framework.\n\n\n###   Man-in-the-middle attacks\n\nA man-in-the-middle (MitM) attack describes a broad category of attacks where an **attacker sits between a client and a server and intercepts the data going between the two**.\n\n![man-in-the-middle-attack-how-avoid](https://codersnack.com/assets/images/man-in-the-middle-attack-how-avoid.png)\n\nThis can be done in a **lot of ways**: by gaining access to or listening in on an **insecure website**, **mimicking** a public WiFi **router**, DNS **spoofing**, or through **malware** / adware like SuperFish.\n\nHere's a high-level overview of MitM attacks, and how websites can protect themselves and their users:  [Video](https://youtu.be/8OR2dDIaIDw?t=57)\n\nAs a developer, you can greatly reduce the chance of a MitM attack by ensuring that you **enable HTTPS on your server**, use an SSL certificate from a trusted certificate authority, and **ensure your code uses HTTPS instead of the insecure HTTP**.\n\nIn terms of **cookies**, you should add the ***Secure* attribute to your cookies so they can only be sent over a secure HTTPS connection**:\n```\ndocument.cookie = 'dark_mode=false; Secure';\n```\n\nJust remember that the Secure attribute **doesn't actually encrypt any data in your cookie** – it just ensures that the cookie can't be sent over an HTTP connection.\n\nHowever,**a bad actor could still possibly intercept and manipulate the cookie**. To prevent this from happening, you can also **use the *HttpOnly* parameter**:\n\n```\ndocument.cookie = 'dark_mode=false; Secure; HttpOnly';\n```\n\n**Cookies with *HttpOnly* can only be accessed by the server, and not by the browser's Document.cookie API**. This is perfect for things like a login session, where only the server really needs to know if you're signed into a site, and you don't need that information client side.\n\n\n###  XSS attacks\n\nAn **XSS (cross-site scripting) attack** describes a category of attacks **when a bad actor injects unintended, potentially dangerous code into a website**.\n\nThese attacks are very problematic because they could affect every person that visits the site.\n\n\n![cross-site-scripting](https://codersnack.com/assets/images/cross-site-scripting.svg)\n\n> For example, if a site has a comments section and someone is able to include malicious code as a comment, it's possible that every person who visits the site and reads that comment will be affected.\n\n**In terms of *cookies*, if a bad actor pulls off a successful XSS attack on a site, they could gain access to session cookies and access the site as another signed in user**. From there, they may be able to access the other user's settings, buy things as that user and have it shipped to another address, and so on.\n\nHere's a video that gives a high-level overview of the different types of XSS – Reflected, Stored, DOM-based, and Mutation:  [video](https://youtu.be/EoaDgUgS6QA)\n\nAs a developer, you'll want to **ensure that your server enforces the *Same Origin Policy***, and that **any input you receive from people is properly  sanitized**.\n\nAnd like with preventing MitM attacks, **you should set the *Secure* and *HttpOnly*** parameters with any cookies you use:\n```\ndocument.cookie = 'dark_mode=false; Secure; HttpOnly';\n```\n\n###   CSRF attacks\n\nA **CSRF (cross-site request forgery) attack** is **when a bad actor tricks a person into carrying out an unintended, potentially malicious action**.\n\n> For example, if you're signed into a site and click on a link in a comment, if that link is part of a CSRF attack, it may lead to you unintentionally changing your sign in details, or even deleting your account.\n\n![cross-site-request-forgery](https://codersnack.com/assets/images/cross-site-request-forgery.svg)\n\nWhile CSRF attacks are somewhat related to XSS attacks, specifically reflected XSS attacks where someone inserts malicious code into a site, each preys on a different type of trust.\n\nAccording to Wikipedia, while XSS \"exploits the trust a user has for a particular site, CSRF exploits the trust that a site has in a user's browser.\"\n\nHere's a video that explains the basics of CSRF, and gives some useful examples\n[video](https://youtu.be/eWEgUcHPle0)\n\nAs for **cookies**, one way to **prevent possible CSRF attacks is with the *SameSite* flag**:\n\n```\ndocument.cookie = 'dark_mode=false; Secure; HttpOnly; SameSite=Strict';\n```\n\nThere are a few values you can set for SameSite:\n\n- **Lax**: **Cookies are not sent for embedded content (images, iframes, etc.) but are sent when you click on a link or send a request to the origin the cookie is set for**. For example, if you're on testing.com and you click on a link to go to test.com/about, your browser will send your cookie for test.com with that request\n\n- **Strict**: **Cookies are only sent when you click on a link or send a request from the origin the cookie is set for**. For example, your test.com cookie will only be sent while you're in and around test.com, and not coming from other sites like testing.com\n\n- **None**: **Cookies will be sent with every request, regardless of context.** If you set SameSite to None, you must also add the Secure attribute. It's better to avoid this value if possible\n\n> Major browsers handle SameSite a bit differently. For example, if SameSite isn't set on a cookie, Google Chrome sets it to Lax by default.\n\n\n##  Tracking and privacy\n\n###  Third-party cookies\n\n**A cookie is associated with a particular domain and scheme (such as http or https), and may also be associated with subdomains if the *Set-Cookie Domain* attribute is set.** If the cookie domain and scheme match the current page, the cookie is considered to be from the same site as the page, and is referred to as a ***first-party cookie***.\n\n**If the domain and scheme are different, the cookie is not considered to be from the same site, and is referred to as a *third-party cookie***. While the server hosting a web page sets first-party cookies, the page may contain images or other components stored on servers in other domains (for example, ad banners) that may set third-party cookies. These are **mainly used for advertising and tracking across the web**. For example, the types of cookies used by Google.\n\n**A third-party server can create a profile of a user's browsing history and habits based on cookies sent to it by the same browser when accessing multiple sites**. \n\nFirefox, by default, blocks third-party cookies that are known to contain trackers. Third-party cookies (or just tracking cookies) may also be blocked by other browser settings or extensions. Cookie blocking can cause some third-party components (such as social media widgets) not to function as intended.\n\n> **Note**: Servers can (and should) set the cookie **SameSite** attribute to specify whether or not cookies may be sent to third party sites.\n\n\n###  Cookie-related regulations\n\nLegislation or regulations that cover the use of cookies include:\n\n- The General Data Privacy Regulation (GDPR) in the European Union\n- The ePrivacy Directive in the EU\n- The California Consumer Privacy Act\n\n**These regulations have global reach**. They apply to any site on the World Wide Web that users from these jurisdictions access (the EU and California, with the caveat that California's law applies only to entities with gross revenue over 25 million USD, among things).\n\nThese regulations include requirements such as:\n\n- Notifying users that your site uses cookies.\n- Allowing users to opt out of receiving some or all cookies.\n- Allowing users to use the bulk of your service without receiving cookies.\n\nThere may be other regulations that govern the use of cookies in your locality. The burden is on you to know and comply with these regulations. There are companies that offer \"**cookie banner**\" code that helps you comply with these regulations.\n\n","references":"- [Everything You Need to Know About Cookies for Web Development - Kris Koishigawa](https://www.freecodecamp.org/news/everything-you-need-to-know-about-cookies-for-web-development/)","featured_image_url":"https://codersnack.com/assets/images/web-standards-logo.png","slug":"web-standards-cookies-security-concerns","weblink":"https://codersnack.com/web-standards-cookies-security-concerns","featured_image_preview":{"id":207,"name":"web-standards-logo.png","hash":"9bf9809aebf94adb8506a848445f95af","sha256":"h6yD0wBq4kdFylxQGYdTnkT9jouDkB8jx23AYEhxW30","ext":".png","mime":"image/png","size":7.04,"url":"/uploads/9bf9809aebf94adb8506a848445f95af.png","provider":"local","provider_metadata":null,"created_at":"2022-04-06T13:35:27.438Z","updated_at":"2022-04-06T13:35:27.438Z"}},"codersnacks_category":{"id":25,"header":"Web Standards","description":"All about web standards","snacks_by_cat_json_filename":"web-standards.snacks.json","key":"web-standards","image_url":"https://codersnack.com/assets/images/web-standards-logo.png","created_at":"2022-04-06T11:46:29.528Z","updated_at":"2022-04-06T12:28:37.991Z","image_preview":{"id":205,"name":"web-standards-logo.png","hash":"49a914d205d24f1487f0cf52c3b703b0","sha256":"h6yD0wBq4kdFylxQGYdTnkT9jouDkB8jx23AYEhxW30","ext":".png","mime":"image/png","size":7.04,"url":"/uploads/49a914d205d24f1487f0cf52c3b703b0.png","provider":"local","provider_metadata":null,"created_at":"2022-04-06T11:46:29.544Z","updated_at":"2022-04-06T11:46:29.544Z"}},"title":"Web Standards - Cookies - Security","created_at":"2022-04-06T13:35:55.108Z","updated_at":"2022-04-06T13:35:55.112Z"}]